#### `terraform plan` Success

<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_dynamodb_table.agencies_table will be created
+ resource "aws_dynamodb_table" "agencies_table" {
      + arn              = (known after apply)
      + billing_mode     = "PROVISIONED"
      + hash_key         = "Partition"
      + id               = (known after apply)
      + name             = "agencies-default"
      + range_key        = "Sort"
      + read_capacity    = 20
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + write_capacity   = 20

      + attribute {
          + name = "LSI"
          + type = "S"
        }
      + attribute {
          + name = "Partition"
          + type = "S"
        }
      + attribute {
          + name = "Sort"
          + type = "S"
        }

      + local_secondary_index {
          + name               = "ParentIdIndex"
          + non_key_attributes = []
          + projection_type    = "ALL"
          + range_key          = "LSI"
        }

      + point_in_time_recovery {
          + enabled = (known after apply)
        }

      + server_side_encryption {
          + enabled = (known after apply)
        }
    }

  # aws_dynamodb_table.producer_table will be created
+ resource "aws_dynamodb_table" "producer_table" {
      + arn              = (known after apply)
      + billing_mode     = "PROVISIONED"
      + hash_key         = "AgencyId"
      + id               = (known after apply)
      + name             = "producer-default"
      + range_key        = "SurveyId"
      + read_capacity    = 20
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + write_capacity   = 20

      + attribute {
          + name = "AgencyId"
          + type = "S"
        }
      + attribute {
          + name = "SurveyId"
          + type = "S"
        }

      + point_in_time_recovery {
          + enabled = (known after apply)
        }

      + server_side_encryption {
          + enabled = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>

*Workflow: `Terraform`, Action: `terraform-plan-dynamodb`*